# Car Dataset Analysis for Data Cleaning

**Importing python libraries**

In [5]:
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

**We are importing 'Raw_Car_Data.csv' file consist of unstructed or raw on which, we have to perform cleaning operations**

In [6]:
dataset = pd.read_csv('Raw_Car_Data.csv')

In [7]:
dataset.head()

,Unnamed: 0,car_name,car_prices_in_rupee,kms_driven,fuel_type,transmission,ownership,manufacture,engine,Seats
0,0,Jeep Compass 2.0 Longitude Option BSIV,10.03 Lakh,"86,226 kms",Diesel,Manual,1st Owner,2017,1956 cc,5 Seats
1,1,Renault Duster RXZ Turbo CVT,12.83 Lakh,"13,248 kms",Petrol,Automatic,1st Owner,2021,1330 cc,5 Seats
2,2,Toyota Camry 2.5 G,16.40 Lakh,"60,343 kms",Petrol,Automatic,1st Owner,2016,2494 cc,5 Seats
3,3,Honda Jazz VX CVT,7.77 Lakh,"26,696 kms",Petrol,Automatic,1st Owner,2018,1199 cc,5 Seats
4,4,Volkswagen Polo 1.2 MPI Highline,5.15 Lakh,"69,414 kms",Petrol,Manual,1st Owner,2016,1199 cc,5 Seats

In [8]:
dataset.shape

(5512, 10)

In [9]:
dataset.columns

Index(['Unnamed: 0', 'car_name', 'car_prices_in_rupee', 'kms_driven',
       'fuel_type', 'transmission', 'ownership', 'manufacture', 'engine',
       'Seats'],
      dtype='object')

**Checking for null values in the columns of dataset**

In [10]:
dataset.isnull().sum()

Unnamed: 0             0
car_name               0
car_prices_in_rupee    0
kms_driven             0
fuel_type              0
transmission           0
ownership              0
manufacture            0
engine                 0
Seats                  0
dtype: int64

**Null values in percentage**

In [11]:
(dataset.isnull().sum()/dataset.shape[0])*100

Unnamed: 0             0.0
car_name               0.0
car_prices_in_rupee    0.0
kms_driven             0.0
fuel_type              0.0
transmission           0.0
ownership              0.0
manufacture            0.0
engine                 0.0
Seats                  0.0
dtype: float64

In [12]:
dataset.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5512 entries, 0 to 5511
Data columns (total 10 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   Unnamed: 0           5512 non-null   int64
 1   car_name             5512 non-null   object
 2   car_prices_in_rupee  5512 non-null   object
 3   kms_driven           5512 non-null   object
 4   fuel_type            5512 non-null   object
 5   transmission         5512 non-null   object
 6   ownership            5512 non-null   object
 7   manufacture          5512 non-null   int64
 8   engine               5512 non-null   object
 9   Seats                5512 non-null   object
dtypes: int64(2), object(8)
memory usage: 430.8+ KB

In [13]:
dataset.dropna(inplace=True)

From the above code, it will remove the null or missing values from dataset

In [14]:
dataset.head()

,Unnamed: 0,car_name,car_prices_in_rupee,kms_driven,fuel_type,transmission,ownership,manufacture,engine,Seats
0,0,Jeep Compass 2.0 Longitude Option BSIV,10.03 Lakh,"86,226 kms",Diesel,Manual,1st Owner,2017,1956 cc,5 Seats
1,1,Renault Duster RXZ Turbo CVT,12.83 Lakh,"13,248 kms",Petrol,Automatic,1st Owner,2021,1330 cc,5 Seats
2,2,Toyota Camry 2.5 G,16.40 Lakh,"60,343 kms",Petrol,Automatic,1st Owner,2016,2494 cc,5 Seats
3,3,Honda Jazz VX CVT,7.77 Lakh,"26,696 kms",Petrol,Automatic,1st Owner,2018,1199 cc,5 Seats
4,4,Volkswagen Polo 1.2 MPI Highline,5.15 Lakh,"69,414 kms",Petrol,Manual,1st Owner,2016,1199 cc,5 Seats

In [15]:
dataset['car_name']

0       Jeep Compass 2.0 Longitude Option BSIV
1                 Renault Duster RXZ Turbo CVT
2                           Toyota Camry 2.5 G
3                            Honda Jazz VX CVT
4             Volkswagen Polo 1.2 MPI Highline
                         ...
5507                   BMW X1 sDrive 20d xLine
5508                     BMW M Series M4 Coupe
5509                Jaguar XF 2.2 Litre Luxury
5510                        BMW 7 Series 730Ld
5511                 BMW 5 Series 520d M Sport
Name: car_name, Length: 5512, dtype: object

**We will seperate 'car_name' column into another column such as company_name.**

In [16]:
x = dataset['car_name'][0]
x[:x.index(" ")]

'Jeep'

In [17]:
def company_name(x):
    return x[:x.index(" ")]

In [18]:
dataset["company_name"] = dataset['car_name'].apply(company_name)

In [19]:
dataset.head()

,Unnamed: 0,car_name,car_prices_in_rupee,kms_driven,fuel_type,transmission,ownership,manufacture,engine,Seats,company_name
0,0,Jeep Compass 2.0 Longitude Option BSIV,10.03 Lakh,"86,226 kms",Diesel,Manual,1st Owner,2017,1956 cc,5 Seats,Jeep
1,1,Renault Duster RXZ Turbo CVT,12.83 Lakh,"13,248 kms",Petrol,Automatic,1st Owner,2021,1330 cc,5 Seats,Renault
2,2,Toyota Camry 2.5 G,16.40 Lakh,"60,343 kms",Petrol,Automatic,1st Owner,2016,2494 cc,5 Seats,Toyota
3,3,Honda Jazz VX CVT,7.77 Lakh,"26,696 kms",Petrol,Automatic,1st Owner,2018,1199 cc,5 Seats,Honda
4,4,Volkswagen Polo 1.2 MPI Highline,5.15 Lakh,"69,414 kms",Petrol,Manual,1st Owner,2016,1199 cc,5 Seats,Volkswagen

**We will seperate 'car_name' column into another column such as car_names.**

In [20]:
def car_names(x):
    return x[x.index(" ")+1:]

In [21]:
dataset['car_names'] = dataset['car_name'].apply(car_names)

In [22]:
dataset.head()

,Unnamed: 0,car_name,car_prices_in_rupee,kms_driven,fuel_type,transmission,ownership,manufacture,engine,Seats,company_name,car_names
0,0,Jeep Compass 2.0 Longitude Option BSIV,10.03 Lakh,"86,226 kms",Diesel,Manual,1st Owner,2017,1956 cc,5 Seats,Jeep,Compass 2.0 Longitude Option BSIV
1,1,Renault Duster RXZ Turbo CVT,12.83 Lakh,"13,248 kms",Petrol,Automatic,1st Owner,2021,1330 cc,5 Seats,Renault,Duster RXZ Turbo CVT
2,2,Toyota Camry 2.5 G,16.40 Lakh,"60,343 kms",Petrol,Automatic,1st Owner,2016,2494 cc,5 Seats,Toyota,Camry 2.5 G
3,3,Honda Jazz VX CVT,7.77 Lakh,"26,696 kms",Petrol,Automatic,1st Owner,2018,1199 cc,5 Seats,Honda,Jazz VX CVT
4,4,Volkswagen Polo 1.2 MPI Highline,5.15 Lakh,"69,414 kms",Petrol,Manual,1st Owner,2016,1199 cc,5 Seats,Volkswagen,Polo 1.2 MPI Highline

**car_prices_in_rupee change values**

In [23]:
dataset['car_prices_in_rupee'] = dataset['car_prices_in_rupee'].str.replace(",","")

In [24]:
def rupe_change(x):
    p = x.split(" ")
    try:
        if p[1] == "Lakh":
            return str(round(float(p[0])*100000,1))
        elif p[1] == "Crore":
            return str(round(float(p[0])*10000000,1))
    except:
        return x

In [25]:
dataset['car_prices_in_rupee'] = dataset['car_prices_in_rupee'].apply(rupe_change)

In [26]:
dataset.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5512 entries, 0 to 5511
Data columns (total 12 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   Unnamed: 0           5512 non-null   int64
 1   car_name             5512 non-null   object
 2   car_prices_in_rupee  5389 non-null   object
 3   kms_driven           5512 non-null   object
 4   fuel_type            5512 non-null   object
 5   transmission         5512 non-null   object
 6   ownership            5512 non-null   object
 7   manufacture          5512 non-null   int64
 8   engine               5512 non-null   object
 9   Seats                5512 non-null   object
 10  company_name         5512 non-null   object
 11  car_names            5512 non-null   object
dtypes: int64(2), object(10)
memory usage: 516.9+ KB

**Change datatype of "car_prices_in_rupee" column from object to float64**

In [27]:
dataset['car_prices_in_rupee'] = dataset['car_prices_in_rupee'].astype('float')

In [28]:
dataset.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5512 entries, 0 to 5511
Data columns (total 12 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   Unnamed: 0           5512 non-null   int64
 1   car_name             5512 non-null   object
 2   car_prices_in_rupee  5389 non-null   float64
 3   kms_driven           5512 non-null   object
 4   fuel_type            5512 non-null   object
 5   transmission         5512 non-null   object
 6   ownership            5512 non-null   object
 7   manufacture          5512 non-null   int64
 8   engine               5512 non-null   object
 9   Seats                5512 non-null   object
 10  company_name         5512 non-null   object
 11  car_names            5512 non-null   object
dtypes: float64(1), int64(2), object(9)
memory usage: 516.9+ KB

# kms_driven

In [29]:
dataset['kms_driven'] = dataset['kms_driven'].str.replace(",","")   #replace colon from the values of "kms_driven" column
dataset['kms_driven'] = dataset['kms_driven'].str.replace(" kms","")   #replace " kms" from the values of "kms_driven" column

In [30]:
dataset['kms_driven']

0       86226
1       13248
2       60343
3       26696
4       69414
        ...
5507    45000
5508    29000
5509    90000
5510    79000
5511    42000
Name: kms_driven, Length: 5512, dtype: object

In [31]:
dataset['kms_driven'] = dataset['kms_driven'].astype("int64")

In [32]:
dataset.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5512 entries, 0 to 5511
Data columns (total 12 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   Unnamed: 0           5512 non-null   int64
 1   car_name             5512 non-null   object
 2   car_prices_in_rupee  5389 non-null   float64
 3   kms_driven           5512 non-null   int64
 4   fuel_type            5512 non-null   object
 5   transmission         5512 non-null   object
 6   ownership            5512 non-null   object
 7   manufacture          5512 non-null   int64
 8   engine               5512 non-null   object
 9   Seats                5512 non-null   object
 10  company_name         5512 non-null   object
 11  car_names            5512 non-null   object
dtypes: float64(1), int64(3), object(8)
memory usage: 516.9+ KB

# Engine

In [33]:
dataset['engine'] = dataset['engine'].str.replace(" cc","")   #replace colon from the values of "engine" column
dataset['engine'] = dataset['engine'].astype("int64")   #replace " kms" from the values of "engine" column

In [34]:
dataset.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5512 entries, 0 to 5511
Data columns (total 12 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   Unnamed: 0           5512 non-null   int64
 1   car_name             5512 non-null   object
 2   car_prices_in_rupee  5389 non-null   float64
 3   kms_driven           5512 non-null   int64
 4   fuel_type            5512 non-null   object
 5   transmission         5512 non-null   object
 6   ownership            5512 non-null   object
 7   manufacture          5512 non-null   int64
 8   engine               5512 non-null   int64
 9   Seats                5512 non-null   object
 10  company_name         5512 non-null   object
 11  car_names            5512 non-null   object
dtypes: float64(1), int64(4), object(7)
memory usage: 516.9+ KB

In [35]:
dataset['engine']

0       1956
1       1330
2       2494
3       1199
4       1199
        ...
5507    2995
5508    1968
5509    2755
5510    2967
5511    1991
Name: engine, Length: 5512, dtype: int64

# Seats

In [36]:
dataset['Seats']

0       5 Seats
1       5 Seats
2       5 Seats
3       5 Seats
4       5 Seats
         ...
5507    7 Seats
5508    5 Seats
5509    5 Seats
5510    6 Seats
5511    5 Seats
Name: Seats, Length: 5512, dtype: object

In [37]:
dataset['Seats'] = dataset['Seats'].str.replace(" Seats","")   #replace colon from the values of "Seats" column
dataset['Seats'] = dataset['Seats'].astype("int64")   #replace " kms" from the values of "Seats" column

In [38]:
dataset['Seats']

0       5
1       5
2       5
3       5
4       5
       ..
5507    7
5508    5
5509    5
5510    6
5511    5
Name: Seats, Length: 5512, dtype: int64

In [39]:
dataset = dataset.drop("car_name", axis='columns')

In [40]:
dataset.head()

,Unnamed: 0,car_prices_in_rupee,kms_driven,fuel_type,transmission,ownership,manufacture,engine,Seats,company_name,car_names
0,0,1003000.0,86226,Diesel,Manual,1st Owner,2017,1956,5,Jeep,Compass 2.0 Longitude Option BSIV
1,1,1283000.0,13248,Petrol,Automatic,1st Owner,2021,1330,5,Renault,Duster RXZ Turbo CVT
2,2,1640000.0,60343,Petrol,Automatic,1st Owner,2016,2494,5,Toyota,Camry 2.5 G
3,3,777000.0,26696,Petrol,Automatic,1st Owner,2018,1199,5,Honda,Jazz VX CVT
4,4,515000.0,69414,Petrol,Manual,1st Owner,2016,1199,5,Volkswagen,Polo 1.2 MPI Highline

In [44]:
dataset.to_csv('Cleaned_Car_Data.csv',index=False)

*Above command will create a new csv file of named as 'Cleaned_Car_Data.csv'*